Revit 2026 API

# PanelTransform Property

---

This property is used to find the transform of a curtain panel within project.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Transform Transform { get; }
```
```vb
Public ReadOnly Property Transform As Transform
	Get
```
```cpp
public:
property Transform^ Transform {
	Transform^ get ();
}
```
```fsharp
member Transform : Transform with get
```

#### Property Value

Transform

The Transform property returns a Autodesk::Revit::DB::Transform object that can be used to find the transfer matrix of a curtain panel within the project.

#### Reference

Panel Class

Autodesk.Revit.DB Namespace